ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_eru_map.h
#define ERU0_OGU0_PERIPHERAL_TRIGGER_CCU40_SR0  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU0_PERIPHERAL_TRIGGER_VADC_C0SR2 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU1_PERIPHERAL_TRIGGER_CCU40_SR1  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU1_PERIPHERAL_TRIGGER_VADC_C0SR2 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU2_PERIPHERAL_TRIGGER_CCU40_SR2  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU2_PERIPHERAL_TRIGGER_VADC_C0SR3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU3_PERIPHERAL_TRIGGER_CCU40_SR3  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU3_PERIPHERAL_TRIGGER_VADC_C0SR3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU0_PERIPHERAL_TRIGGER_CCU41_SR0  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU1_PERIPHERAL_TRIGGER_CCU41_SR1  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU2_PERIPHERAL_TRIGGER_CCU41_SR2  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU3_PERIPHERAL_TRIGGER_CCU41_SR3  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#endif


#if (UC_DEVICE == XMC1401) && (UC_PACKAGE == VQFN48)
#define ERU0_ETL0_INPUTA_P2_4               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL0_INPUTA_VADC0_G0BFLOUT0    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL0_INPUTB_P2_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL0_INPUTB_P2_2               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL0_INPUTB_VADC0_G1BFLOUT0    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL1_INPUTA_P2_5               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL1_INPUTA_VADC0_G0BFLOUT1    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL1_INPUTB_P2_1               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL1_INPUTB_P2_3               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL1_INPUTB_VADC0_G1BFLOUT1    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL2_INPUTA_P2_6               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL2_INPUTA_VADC0_G0BFLOUT2    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL2_INPUTB_P2_10              XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL2_INPUTB_P2_11              XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTB_VADC0_G1BFLOUT2    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL3_INPUTA_P2_7               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL3_INPUTA_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL3_INPUTB_P2_8               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL3_INPUTB_P2_9               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL0_INPUTA_P3_0               XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL0_INPUTA_P4_4               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL0_INPUTA_P4_7               XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL0_INPUTB_CCU40_ST0          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL0_INPUTB_CCU41_ST0          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL1_INPUTA_P4_5               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL1_INPUTB_CCU40_ST1          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL1_INPUTB_CCU41_ST1          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL2_INPUTA_P4_6               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL2_INPUTB_CCU40_ST2          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL2_INPUTB_CCU41_ST2          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL3_INPUTA_P2_12              XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL3_INPUTA_P2_13              XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL3_INPUTB_CCU40_ST3          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL3_INPUTB_CCU41_ST3          XMC_ERU_ETL_INPUT_B1

#define ERU0_OGU0_PERIPHERAL_TRIGGER_CCU40_SR0  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU0_PERIPHERAL_TRIGGER_VADC_C0SR2 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU1_PERIPHERAL_TRIGGER_CCU40_SR1  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU1_PERIPHERAL_TRIGGER_VADC_C0SR2 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU2_PERIPHERAL_TRIGGER_CCU40_SR2  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU2_PERIPHERAL_TRIGGER_VADC_C0SR3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU0_OGU3_PERIPHERAL_TRIGGER_CCU40_SR3  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU3_PERIPHERAL_TRIGGER_VADC_C0SR3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU0_PERIPHERAL_TRIGGER_CCU41_SR0  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU1_PERIPHERAL_TRIGGER_CCU41_SR1  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU2_PERIPHERAL_TRIGGER_CCU41_SR2  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU3_PERIPHERAL_TRIGGER_CCU41_SR3  XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#endif


#if (UC_DEVICE == XMC1402) && (UC_PACKAGE == LQFP64)
#define ERU0_ETL0_INPUTA_ACMP0_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL0_INPUTA_ACMP2_OUT          XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL0_INPUTA_P2_4               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL0_INPUTA_VADC0_G0BFLOUT0    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL0_INPUTB_ACMP0_OUT          XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL0_INPUTB_P2_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL0_INPUTB_P2_2               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL0_INPUTB_VADC0_G1BFLOUT0    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL1_INPUTA_ACMP1_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL1_INPUTA_ACMP3_OUT          XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL1_INPUTA_P2_5               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL1_INPUTA_VADC0_G0BFLOUT1    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL1_INPUTB_ACMP1_OUT          XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL1_INPUTB_P2_1               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL1_INPUTB_P2_3               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL1_INPUTB_VADC0_G1BFLOUT1    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL2_INPUTA_ACMP2_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL2_INPUTA_ACMP4_OUT          XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL2_INPUTA_P2_6               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL2_INPUTA_VADC0_G0BFLOUT2    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL2_INPUTB_ACMP2_OUT          XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL2_INPUTB_P2_10              XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL2_INPUTB_P2_11              XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTB_VADC0_G1BFLOUT2    XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL3_INPUTA_ACMP5_OUT          XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL3_INPUTA_ACMP7_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL3_INPUTA_P2_7               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL3_INPUTA_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL3_INPUTB_ACMP6_OUT          XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL3_INPUTB_P2_8               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL3_INPUTB_P2_9               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL0_INPUTA_ACMP1_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL0_INPUTA_P3_0               XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL0_INPUTA_P4_4               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL0_INPUTA_P4_7               XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL0_INPUTB_CCU40_ST0          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL0_INPUTB_CCU41_ST0          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL0_INPUTB_CCU80_ST0          XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL0_INPUTB_CCU81_ST0          XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL1_INPUTA_ACMP3_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL1_INPUTA_P3_1               XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL1_INPUTA_P3_3               XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL1_INPUTA_P4_5               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL1_INPUTB_CCU40_ST1          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL1_INPUTB_CCU41_ST1          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL1_INPUTB_CCU80_ST3          XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL1_INPUTB_CCU81_ST3          XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL2_INPUTA_ACMP2_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL2_INPUTA_P3_2               XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL2_INPUTA_P3_4               XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL2_INPUTA_P4_6               XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL2_INPUTB_CCU40_ST2          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL2_INPUTB_CCU41_ST2          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL2_INPUTB_CCU80_ST1          XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL2_INPUTB_CCU81_ST1          XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL3_INPUTA_ACMP0_OUT          XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL3_INPUTA_P2_12              XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL3_INPUTA_P2_13              XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL3_INPUTA_POSIF1_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL3_INPUTB_CCU40_ST3          XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL3_INPUTB_CCU41_ST3          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL3_INPUTB_CCU80_ST2          XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL3_INPUTB_CCU81_ST2          XMC_ERU_ETL_INPUT_B3

